Routing Configurations

OSPF on R1

R1(config)# router ospf 1
R1(config-config)# router-id 1.1.1.1
R1(config-config)# network 10.10.13.0 0.0.0.255 area 1
R1(config-config)# network 10.10.12.0 0.0.0.255 area 1

OSPF on R2

R2(config)# router ospf 1
R2(config-config)# router-id 2.2.2.2
R2(config-config)# network 10.10.12.0 0.0.0.255 area 1


OSPF on R3

R3(config)# router ospf 1
R3(config-config)# router-id 2.2.2.2
R3(config-config)# network 10.10.13.0 0.0.0.255 area 1

R3(config)# router ospf 0
R3(config-config)# network 10.10.35.0 0.0.0.255 area 0
R3(config-config)# network 10.10.34.0 0.0.0.255 area 0

R4 Routing Configuration

OSPF on R4

R4(config)# router ospf 0
R4(config-config)# network 10.10.34.0 0.0.0.255 area 0
R4(config-config)# network 10.10.45.0 0.0.0.255 area 0
R4(config-config)# exit

EIGRP on R4

R4(config)# router eigrp 150
R4(config-config)# network 10.10.48.0

R5 Routing Configuration

OSPF on R5
R5(config)# router ospf 2
R5(config-config)# network 10.10.56.0 0.0.0.255 area 2

R5(config)# router ospf 0
R5(config-config)# network 10.10.45.0 0.0.0.255 area 0
R5(config-config)# network 10.10.35.0 0.0.0.255 area 0

R6 Routing Configurations

R6(config)# router ospf 2
R6(config-config)# network 10.10.56.0 0.0.0.255 area 2
R6(config-config)# network 10.10.67.0 0.0.0.255 area 2

R7 Routing configurations

R7(config)# router ospf 2
R7(config-config)# network 10.10.67.0 0.0.0.255 area 2

R8

R8(config)# router eigrp network 150
R8(config-config)# network 10.10.48.0













